quest_system_1557614333_name=^?^A Holy Indulgence
quest_system_1557614333_stage_0=^?^Buy a Holy Indulgence.
quest_system_1557614333_stage_1=^?^Give the Indulgence to the pirates.
quest_system_1557614333_stage_2=^?^The Indulgence is no longer necessary. Pirate Black Eye and his crew are dead.
quest_system_1557614333_task=^?^Pirate Black Eye and his ship and crew are cursed. In the daytime it's a common ship, but at night both the ship and its crew turn into ghosts. The captain asks you to buy a Holy Indulgence, which is sold in Marshan Swamp, in the Temple of Deceased Souls.<br>[reward]
